Бухгалтерские_задачи_по_методичке/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Субконто</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотруднкики</name>
      <description>Сотруднкики</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерские_задачи_по_методичке/src/Constants/УчетПоСкладам/ValueManagerModule.bsl
Процедура ПриЗаписи(Отказ)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланСчетов.Ссылка КАК Ссылка,
		|	ПланСчетов.Наименование КАК Наименование
		|ИЗ
		|	ПланСчетов.Бухгалтерский КАК ПланСчетов
		|ГДЕ
		|	ПланСчетов.Забалансовый = ЛОЖЬ
		|	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
		|	И (&УчетПоСкладам
		|			ИЛИ ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Склады))";
	
	Запрос.УстановитьПараметр("УчетПоСкладам", Константы.УчетПоСкладам.Получить() );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		СчетСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		
		Попытка
			
			ЗаблокироватьДанныеДляРедактирования(СчетСсылка);
			
			СчетОбъект = СчетСсылка.ПолучитьОбъект();

			
			ВидыСубконтоСчета = СчетОбъект.ВидыСубконто;
			
			СтрокаВидыСубконтоСклад = ВидыСубконтоСчета.Найти(
			ПланыВидовХарактеристик.ВидыСубконто.Склады, "ВидСубконто");
			
			Если СтрокаВидыСубконтоСклад = Неопределено И ВидыСубконтоСчета.Количество() < 2 Тогда
			
				 СтрокаВидыСубконтоСклад = ВидыСубконтоСчета.Добавить();
				 СтрокаВидыСубконтоСклад.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Склады;
				 
			ИначеЕсли Константы.УчетПоСкладам.Получить() = Ложь Тогда 	 
				
				ВидыСубконтоСчета.Удалить(СтрокаВидыСубконтоСклад);
				
			КонецЕсли;
			
			СчетОбъект.Записать();
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить аналитику счета " + ВыборкаДетальныеЗаписи.Наименование;
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
